[
  {
    "slug": "iot-web3-hands-on-2025",
    "locale": "en",
    "title": "From NFC Tooling to Multichain Architecture: A Hands-On Journey Through IoT and Web3",
    "shortDescription": "Building NFC workflows, designing a scalable multichain wallet and leading a hybrid engineering team as a CTO.",
    "createdAt": "2025-12-08T12:11:18.023Z",
    "tags": ["iot", "web3", "engineering", "nfc", "management"],
    "image": "/nfc-blockchain.png",
    "content": "<p>In the second half of 2025, I had the chance to work hands-on on a project that blended two domains rarely found in the same sentence: IoT and Web3. Despite a fairly busy CTO schedule, I wanted to stay involved technically — and this project offered more than enough opportunities.</p>\n\n<h2>IoT: Getting NFC cards to behave</h2>\n<p>Together with a colleague, we tackled a full cycle of working with NFC cards: activating them, taking them out of transport mode, creating directories, configuring files with various access levels. I developed software that later served as a remote tool for factories in Russia and China. With its help, we processed more than five thousand NFC cards. By the end of it, I could almost tell what state a card was in just by the sound of the reader — a skill that, surprisingly, is not yet listed on LinkedIn.</p>\n\n<h2>Web3: Designing a multichain wallet that grows without friction</h2>\n<p>The Web3 part of the project focused on designing the architecture of a scalable multichain wallet. The long-term goal was clear: support many networks without rewriting half the system each time. I manually implemented around ten networks myself and designed a unified approach for extending networks that run on the same virtual machine, such as EVM-compatible chains. <span class='accent'>I've achieved the point where networks running on a single VM can be added in a couple of hours.</span>. Under my guidance, the team added support for nearly twenty networks, with a few more underway.</p>\n\n<h2>Management: Leading a hybrid team while wearing multiple hats</h2>\n<p>From a management standpoint, the project was just as interesting. As a CTO, I couldn’t be fully dedicated to development, so I assembled a mixed team of in-house engineers and project-based specialists. Over time, the composition changed — which is normal for a growing project — and eventually we arrived at a strong, well-balanced team with the right combination of technical and communication skills. When the structure solidified, I handed the project over to the team lead and shifted into a supervisory role.</p>\n\n<p>Looking back, the project brought together engineering, architecture, coordination and a fair amount of cross-timezone problem solving. A demanding experience, but also one of the most rewarding.</p>"
  },
  {
    "slug": "iot-web3-hands-on-2025",
    "locale": "ru",
    "title": "От NFC до мультичейна: практическое погружение в IoT и Web3",
    "shortDescription": "Работа с NFC-картами, проектирование масштабируемого мультичейн-кошелька и руководство гибкой инженерной командой.",
    "createdAt": "2025-12-08T12:11:18.023Z",
    "tags": ["iot", "web3", "engineering", "nfc", "management"],
    "image": "/nfc-blockchain.png",
    "content": "<p>Во второй половине 2025 года мне выпала возможность поработать руками над проектом, который объединил IoT и Web3 — сочетание, которое нечасто увидишь в одном техзадании. Несмотря на загруженность в роли CTO, мне хотелось сохранить техническое участие, и этот проект дал такую возможность.</p>\n\n<h2>IoT: Привести NFC-карты к порядку</h2>\n<p>Совместно с коллегой мы прошли полный цикл работы с NFC-картами: активация, вывод из транспортного режима, создание директорий, настройка файлов с различными уровнями доступа. Я написал софт, который затем использовался на заводах в России и Китае как инструмент удалённой настройки. Через него прошло более пяти тысяч NFC-карт. К концу работы я уже почти по звуку ридера мог понять, в каком состоянии карточка — навык, который, увы, пока не добавишь в резюме отдельной строкой.</p>\n\n<h2>Web3: Архитектура мультичейн-кошелька, готового к росту</h2>\n<p>Web3-часть проекта была посвящена архитектуре масштабируемого мультичейн-кошелька. Цель состояла в том, чтобы добавление новых сетей не превращалось в переписывание системы. Я вручную реализовал около десяти сетей и разработал подход для расширения сетей, работающих на одной виртуальной машине, например EVM. <span class='accent'>Добился того, что сети которые работают на базе одной VM можно добавлять за пару часов</span>. Под моим руководством команда добавила поддержку почти двух десятков сетей, и ещё несколько находятся в процессе.</p>\n\n<h2>Менеджмент: работа с гибкой командой и несколько ролей одновременно</h2>\n<p>С управленческой точки зрения проект был не менее увлекательным. Поскольку я не мог быть включён в разработку фулл-тайм, я сформировал смешанную команду из штатных инженеров и специалистов на проектной основе. По мере развития проекта состав несколько раз менялся — нормальный этап роста — и в итоге сложилась сильная команда с правильным набором хард- и софт-скиллов. Когда процессы стабилизировались, я передал проект лиду и перешёл к роли наблюдателя.</p>\n\n<p>Сейчас, оглядываясь назад, вижу, что проект сочетал в себе технологию, архитектуру, командную работу и немало задач, решённых в разнице часовых поясов. Опыт получился непростой, но однозначно ценный.</p>"
  }
]
